{
    "tablet_stone":"While studying a manner to magically compress stone, you happened on a strange phenomenon. A simple manipulation of terra and ordo did compress the stone. However, in the hours after the first successful compression, the resulting condensed tablet began to behave strangely. Writing began to appear on its surface, writing that seemed undecipherable and strange that changed rapidly as you looked upon it. After building up the courage to touch it, the writing itself changed and took on symbols you could understand. The writing seems to read your intentions and change based on your thoughts.",
    "tablet_stone_2":"The tablet informed you that the magic you had used to create it had been used millenia ago in shamanistic rituals. The tablets themselves act as a conduit between the living, physical world and the spiritual world. By creating this initial tablet, you had reconnected the two worlds, albeit in a rather limited form. You're sure that spending time studying this newfound repository of knowledge will be incredibly useful.",
    "tablet_nether":"Delving further into the more occult histories regarding the divines, you began to notice a few implications where the texts were especially vague. You began to notice evidence of rituals that were contrary to the nature of the divines, nefarious even. Your experiments attempting to infuse the darker aspects of magic into stone tablets have hitherto been unsuccessful, leading to you searching for another conduit of magic. You've discovered that netherrack exhibits similar magical compressability to stone. You've now created a new, darker type of stone tablet",
    "tablet_nether_2":"Like the stone tablet, writing began to appear that also responded to your thoughts and desires, answering questions the stone tablet would not. Using this, it won't be long before you will be able to uncover the less savory realm of ritual magic.",
    "ritual_altar":"Following up on your discovery of the strange vis activity around the carved greatwood wands and staves, you realized the need for a structure that could withstand the pressure of highly concentrated magic without leading to massive flux spills. Using the latent power of a wither skull and a balanced shard, you've managed to create an altar that is able to withstand and contain vis fields.",
    "ritual_altar_2":"The Ritual Altar should allow you to charge and activate Ritual Tablets using vis without too much danger. That is, it shouldn't explode in the presence the hypercompressed magic of the already magically infused tablets being bombarded with streams of vis. The divines will definitely take note of the buildup of magic. What happens as a result of the ritual, however, is entirely up to the divines.",
    "rite_knowledge":"You've managed to interpret some more of the writing shown to you by the stone tablets. The writings speak of a promise of great knowledge for those who have proven themselves to be virtuous and worthy. You were sure there was some way to communicate to these divines what knowledge you seek. Using what you know about the stone tablets, you've managed to create a medium that communicates this desire. By infusing a stone tablet with raw intelligence and the correct symbols, the magical energy in the tablet should take the required form. Though, it likely won't be strong enough to on its own. You'll have to find a way to activate it.",
    "rite_knowledge_2":" You feel something urge you to attempt this ritual as soon as you have done something to merit this divine gift. Now to figure out what...",
    "rite_divines":"Your studies into the history regarding the divines has been fruitful. Quite often the divines are compared to the sky, both day and night. Very often, they seem to be associated with the stars. With some help from the historical accounts, you've invented a ritual that may win their favor. By infusing the magical power of a nether star and the essence of light into a stone tablet, you've created what you believe to be the optimal message to express your appreciation of their guidance.",
    "rite_hell":"You haven't found much information about the dark spirits. However, given the nature of the nether tablet, you were successful in creating a stable reaction. By infusing the magical essense of the nether's blaze into a nether tablet, you should be able to appeal to the darker spirits. It is, however, a bit of guesswork and the reaction to the ritual may have unexpected results. They may not look too kindly on familiarity with the divines. Like other rituals, the tablet won't be strong enough to activate on its own and will have to be activated.",
    "rite_darkness":"You aren't sure how you made the leap but something has been... revealed? By harnessing the power of obsidian and a significant amount of base magic, you can create a form of the nether tablet that embodies darkness. This should certainly get the dark spirits' attention. Something tells you that should they feel so inclined, they darken the world for you for an extended period of time. As with any other tablet, it still needs something more to activate it.",
    "rite_storm":"The histories commonly refer to a flood that removed nearly all land-dwelling life from the world. The folk-tales surrounding it speak of a storm that raged on for months. Seeking a way to bridle this power for your own desires has led you to a few discoveries. First, whatever created the storm must have been absolutely massive in magical power. Second, you can recreate a small portion of it by infusing water and diamond into a nether tablet. The resulting ritual should be effective but miniscule in comparison to the world-filling flood mentioned in the history. It will need further help to activate.",
    "rite_storm_2":"You must find a way to harness more of this power. Perhaps if the power could be contained in some kind of artifact...",
    "shamanwand":"With some experimenting, greatwood has proven capable of holding a significantly more vis by carving aspect runes into the raw wood. These wand cores are capable of storing as much as silverwood, up to 100 vis of each type. Although, it feels a little strange in your hands.",
    "shamanstaff":"Staff cores crafted from rune-carved greatwood can store up to 250 vis of each type. \n You've also discovered the source of the strange feeling you get from it. Vis seems to flow freely through it. You're sure there's some way to utilize this unique attribute."
}